package com.suidifu.coffer;

import java.util.HashMap;
import java.util.Map;

public class TransactionErrCodeSpec {

	public final static Map<String, String> ERR_CODE_MAP = new HashMap<String, String>(){{
		//put("YQ9996", "没有满足条件纪录");
		put("YQ9993", "请求参数数据不对");
		put("YQ9990", "企业本账户没有开通此交易");
		put("YQ9988", "银企直连系统未签约的付款账户");
		//put("YQ9987", "非法的账户网点号");
		put("YQ9986", "企业没有开通银企直联");
		put("YQ9985", "企业签名的证书不对");
		//put("YQ9984", "交易暂停");
		put("YQ9983", "签名验签失败,交易未签名");
		//put("YQ9982", "收款方户名输入错误");
		put("YQ9981", "企业银企直联客户未激活,请联系银行处理");
		put("YQ9980", "企业银企直联客户已暂停,请联系银行处理");
		put("YQ9979", "付款账户错误,该交易为证券公司专用交易");
		//put("YQ9978", "跨行转账上送同城异地标志不符:上送同城,收方账户异地");
		put("YQ9977", "XML报文体解析编码或格式异常");
		//put("YQ9975", "跨行转账上送同城异地标志必须为(1,2)");
		//put("YQ9974", "跨行转账上送同城异地标志不符:上送异地,收方账户同城");
		//put("YQ9972", "目标文件不存在");
		//put("YQ9971", "交易请求频率过高,请稍后再试");
		//put("YQ9970", "付款账户位未通企业网银,不能进行制单操作");
		//put("YQ9969", "批量笔数超限,请减少笔数重试");
		//put("YQ9968", "企业网银客户不允许通过银企直连录入操作");
		//put("YQ9967", "企业网银客户没有可用的录入权限的操作员");
		//put("YQ9966", "批量笔数或金额与文件不符");
		put("YQ9964", "证书已经过期");
		put("YQ9963", "证书尚未生效");
		put("YQ9962", "批量流水号重复");
		put("YQ0000", "无法处理的请求,请核对交易码");
	}};
}
