SET FOREIGN_KEY_CHECKS=0;
delete from app;
delete from contract;
delete from rent_order;
delete from transaction_record;


INSERT INTO `app` (`id`, `app_id`, `app_secret`, `is_disabled`, `host`, `name`, `company_id`, `payee_account_name`, `payee_account_no`, `payee_bank_name`) VALUES 
(1, 'xiaoyu', '70991db75ebb24fa0993f4fa25775022', b'0', 'http://beta.demo2do.com/jupiter/', '寓见', 5, NULL, NULL, NULL);

INSERT INTO `contract` (`id`, `begin_date`, `contract_no`, `contract_status`, `deposit`, `end_date`, `interrupt_date`, `interrupt_reason`, `month_fee`, `non_deposit_guarantee_way`, `payment_instrument`, `renewal`, `url`, `app_id`, `customer_id`, `house_id`, `transfer_status`) VALUES 
-- 预收合同
(220, '2015-10-01', 'pre_payment_contract_no', 0, 0.00, '2016-06-01', NULL, NULL, 100000000.00, b'0', 0, NULL, NULL, 1, -1, 220, 0),

-- 正常合同1
(130, '2015-10-08', 'CC-60507', 0, 2800.00, '2016-04-07', NULL, '', 1400.00, b'0', 0, NULL, NULL, 1, 191, 133, 0),

-- 正常合同2
(131, '2015-04-08', 'CC-77777', 0, 2800.00, '2016-04-07', NULL, '', 1400.00, b'0', 0, NULL, NULL, 1, 191, 133, 0),
	
-- 正常合同3
(132, '2015-04-08', 'CC-88888', 0, 2800.00, '2016-04-07', NULL, '', 1400.00, b'0', 0, NULL, NULL, 1, 191, 133, 0),

-- 正常合同4
(133, '2015-04-08', 'CC-99999', 0, 2800.00, '2016-04-07', NULL, '', 1400.00, b'0', 0, NULL, NULL, 1, 191, 133, 0),

-- 正常合同5
(614, '2015-06-27', 'CC-61770', 0, 3500.00, '2016-06-26', NULL, '', 1750.00, b'0', 1, NULL, NULL, 1, 674, 616, 0),

(650, '2015-06-27', 'CC-00000', 0, 3500.00, '2016-06-26', NULL, '', 1750.00, b'0', 1, NULL, NULL, 1, 674, 616, 0),

(660, '2015-06-27', 'CC-10000', 0, 3500.00, '2016-06-26', NULL, '', 1750.00, b'0', 1, NULL, NULL, 1, 674, 616, 0);


INSERT INTO `rent_order` (`id`, `due_date`, `end_date`, `late_fee`, `order_no`, `order_status`, `paid_rent`, `payout_time`, `is_settled`, `start_date`, `total_rent`, `contract_id`, `customer_id`, `repayment_type`, `user_upload_param`, `unique_particle_id`, `transfer_status`, `modify_time`, `unique_bill_id`, `contract_payment_amount`, `contract_payment_type`) VALUES 
-- 未备案自动生成订单1
(1427, '2015-06-29', NULL, NULL, 'CC-60821-3', 1, 0.00, NULL, b'0', NULL, 1250.00, 220, -1, 1, NULL, NULL, 0, NULL, NULL, NULL, NULL),
-- 未备案自动生成订单2
(1742, NULL, NULL, NULL, 'CC-60794-2', 0, 0.00, NULL, b'0', NULL, 4000.00, 220, -1, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL),

-- 备案订单1
(439, '2015-06-14', '2015-07-13', NULL, 'CC-60607-3', 2, 0.00, NULL, b'0', '2015-06-14', 1.00, 130, 146, 0, NULL, NULL, 0, NULL, NULL, NULL, NULL),

-- 备案订单2超付
(440, '2015-06-14', '2015-07-13', NULL, 'CC-77777-3', 1, 110.00, NULL, b'0', '2015-06-14', 100.00, 131, 146, 0, NULL, NULL, 0, NULL, NULL, NULL, NULL),

-- 备案订单3 paid_rent=null
(450, '2015-06-14', '2015-07-13', NULL, 'CC-88888-3', 1, NULL, NULL, b'0', '2015-06-14', 100.00, 132, 146, 0, NULL, NULL, 0, NULL, NULL, NULL, NULL),

-- 备案订单4
(460, '2015-06-14', '2015-06-13', NULL, 'CC-99999-3', 1, 90.00, NULL, b'0', '2015-05-14', 100.00, 133, 146, 0, NULL, NULL, 0, NULL, NULL, NULL, NULL),

-- 备案订单5
(470, '2015-06-14', '2015-07-13', NULL, 'CC-99999-4', 0, 0.00, NULL, b'0', '2015-06-14', 100.00, 133, 146, 0, NULL, NULL, 0, NULL, NULL, NULL, NULL),

(4809, '2015-9-16', NULL, NULL, 'CC-61770-5', 0, 1750.00, NULL, b'0', NULL, 1750.00, 614, 674, 0, NULL, NULL, 0, NULL, NULL, NULL, NULL),

(4900, '2015-08-27', NULL, NULL, 'CC-00000-1', 2, 1750.00, NULL, b'0', NULL, 1750.00, 650, 674, 0, NULL, NULL, 0, NULL, NULL, NULL, NULL),

(5000, '2015-08-01', NULL, NULL, 'CC-10000-1', 0, 1750.00, NULL, b'0', NULL, 1750.00, 660, 674, 0, NULL, NULL, 0, NULL, NULL, NULL, NULL);


INSERT INTO `transaction_record` (`id`, `card_no`, `channel`, `last_modified_time`, `merchant_payment_no`, `order_no`, `pay_money`, `request_no`, `trade_no`, `transaction_record_status`, `app_id`, `payment_institution_id`,`unique_transaction_id`) VALUES 
-- 未备案未支付记录
(335, NULL, 1, '2015-06-17 22:14:19', '611175014131501056', 'CC-60794-2', 4000.00, '20150617101413611175014131501056', NULL, 0, 1, 2,''),
(336, NULL, 1, '2015-06-17 22:17:18', '611175776064571392', 'CC-60794-2', 4000.00, '20150617101715611175776064571392', NULL, 0, 1, 2,''),
-- 未备案支付记录
(337, NULL, 1, '2015-06-21 16:14:37', '611176758483814400', 'CC-60794-2', 4000.00, '20150617102109611176758483814400', '2015061700001000350055665267', 1, 1, 2,''),
(651, NULL, 1, '2015-07-17 15:19:22', '621878603137090560', 'CC-60821-3', 1250.00, '20150717110631621878603137090560', '2015071700001000440065462829', 1, 1, 2,''),
-- 已备案支付记录
(65, NULL, 1, '2015-06-02 22:20:22', '588707562667837440', 'CC-60607-3', 0.10, '20150416101636588707562667837440', '2015041600001000500049632166', 1, 1, 2,'uniqueTransactionRecordUuid65'),
-- 已备案支付记录
(68, NULL, 1, '2015-06-02 22:00:00', '588707562667837111', 'CC-77777-3', 90.10, '20150416101636588707562667837111', '2015041600001000500049632111', 1, 1, 2,''),

(69, NULL, 1, '2015-06-02 22:00:00', '588707562667837222', 'CC-88888-3', 100.10, '20150416101636588707562667837222', '2015041600001000500049632222', 1, 1, 2,''),

(70, NULL, 1, '2015-06-01 22:00:00', '588707562667837222', 'CC-99999-3', 10.00, '20150416101636588707562667837222', '2015041600001000500049632222', 1, 1, 2,''),

(80, NULL, 1, '2015-06-02 22:00:00', '588707562667837222', 'CC-99999-4', 100.00, '20150416101636588707562667837222', '2015041600001000500049632222', 1, 1, 2,''),
(1120, NULL, 1, '2015-08-18 13:54:13', '633516999974520832', 'CC-61770-5', 1750.00, '20150818015323633516999974520832', '2015081800001000060060976112', 1, 1, 2,''),
-- 重复支付记录
(1130, NULL, 1, '2015-08-18 13:54:13', '633516999974500000', 'CC-00000-1', 1750.00, '20150818015323633516999974520832', '2015081800001000060060976112', 1, 1, 2,''),
(1140, NULL, 1, '2015-08-18 13:54:13', '633516999974500000', 'CC-00000-1', 1750.00, '20150818015323633516999974520832', '2015081800001000060060976112', 1, 1, 2,''),
-- 正常多笔支付
(1150, NULL, 1, '2015-08-29 13:54:13', '633516999974533333', 'CC-10000-1', 1750.00, '20150818015323633516999974520333', '2015081800001000060060976333', 1, 1, 2,''),
(1160, NULL, 1, '2015-09-01 13:54:13', '633516999974533344', 'CC-10000-1', 1750.00, '20150818015323633516999974520444', '2015081800001000060060976444', 1, 1, 2,'');


SET FOREIGN_KEY_CHECKS=1;



