SET FOREIGN_KEY_CHECKS=0;

delete from `usb_key`;
delete from `account`;


INSERT INTO `usb_key` (`id`, `bank_code`, `config`, `key_type`, `uuid`)
VALUES
	(1, 'CMB', '{\"LGNNAM\":\"管知时suidifu\",\"URL\":\"http://cmb.zufangbao.cn:25662\",\"GetTransInfo_Code\":\"GetTransInfo\",\"GetAccInfo_Code\":\"GetAccInfo\",\"GetPaymentInfo_Code\":\"GetPaymentInfo\",\"DCPAYMNT_Code\":\"DCPAYMNT\",\"BUSCOD\":\"N02031\",\"BUSMOD\":\"00002\"}', 0, '44bcf65b-c138-48f4-afd5-929bbdd979ee'),
	(2, 'CMB', NULL, 0, '23988f31-f583-4afa-b866-a46abeafd8b0'),
	(3, 'ICBC', NULL, 1, '0baa43b3-6f77-46ac-81ab-2eb051cd7e76'),
	(4, 'PAB', NULL, 0, 'eb1f22e0-ba46-4719-9d4e-04d51e22c10e');
	

	
INSERT INTO `account` (`id`, `account_name`, `account_no`, `alias`)
VALUES
	(1, '鼎程（上海）商业保理有限公司', '11014671112002', '鼎程回款户'),
	(2, '鼎程（上海）商业保理有限公司', '1001262119204647489', '鼎程－优帕克风险准备金户'),
	(3, '上海优帕克投资管理有限公司', '1001300219000027827', '优帕克回款户'),
	(4, '小寓科技', '',NULL),
	(5, '杭州随地付网络技术有限公司', '1001262119204646188', '随地付'),
	(6, '鼎程 (上海) 商业保理有限公司', '1001184219000050139', '鼎程－寓见风险准备金户'),
	(7, '杭州随地付网络技术有限公司', 'zfbdg@zufangbao.com',  '随地付'),
	(8, '罗仙林', '6222081202010524989', NULL),
	(10, '王晓娣', '6214830285912142', NULL),
	(11, '杭州随地付网络技术有限公司', '1202021519900680156',  '随地付'),
	(12, '杭州蜗居网络技术有限公司', '19025101040024439', NULL),
	(13, '寓见资产管理（上海）有限公司', 'slin@yuapt.com', NULL),
	(14, '上海锐诩酒店管理有限公司', '121912306510801', '安心公寓回款户'),
	(15, '杭州随地付网络技术有限公司', '571907757810703', '随地付'),
	(16, '鼎程（上海）商业保理有限公司', '121916729010301', '鼎程保证金户'),
	(17, '鼎程（上海）商业保理有限公司', '121916729010102', '鼎程回款户'),
	(18, '上海源涞实业有限公司', '121913751710201', '源涞国际回款户'),
	(19, '上海柯罗芭服饰有限公司', '1001215509300557671', '柯罗芭回款户');


SET FOREIGN_KEY_CHECKS=1;